#include <ultra64.h>

#include "sm64.h"
#include "behavior_data.h"
#include "behavior_script.h"
#include "camera.h"
#include "debug.h"
#include "helper_macros.h"
#include "mario.h"
#include "mario_actions_cutscene.h"
#include "math_util.h"
#include "memory.h"
#include "level_update.h"
#include "object_list_processor.h"
#include "rendering_graph_node.h"
#include "spawn_object.h"
#include "spawn_sound.h"
#include "surface_collision.h"
#include "area.h"
#include "geo_layout.h"
#include "ingame_menu.h"
#include "game.h"
#include "obj_behaviors.h"

#include "object_helpers.h"
#include "object_helpers2.h"

struct Waypoint {
    s16 flags;
    Vec3s pos;
};

struct Struct802A272C {
    Vec3f vecF;
    Vec3s vecS;
};

s8 D_8032F0A0[] = { 0xF8, 0x08, 0xFC, 0x04};
s16 D_8032F0A4[] = { 0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80 };
s8 D_8032F0B4[] = { 0x04, 0x06, 0x07, 0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

extern s32 D_80330440;
extern s32 D_8035FF00;

// These can be static:
extern void func_8029D704(Mat4, Mat4, Mat4);
extern void func_8029EA0C(struct Object *);
extern void func_802A205C(struct Object *, s16, s16);
extern void CopyObjPosition(struct Object *, struct Object *);
extern void CopyObjRotation(struct Object *, struct Object *);
extern struct Object *func_8029F270(void *, f32 *);
extern void func_802A06EC(f32, f32, f32);
extern s32 func_802A0974(u32 *, s32);
extern void func_802AA618(s32, s32, f32);
extern void func_802AD82C(s32, s32, f32, s32);

s32 Geo18_8029D890(s32 sp60, UNUSED s32 sp64, void *sp68) {
    Mat4 sp20; 
    struct Object *sp1C;

    if (sp60 == 1) {
        sp1C = (struct Object *)D_8032CFA0; // TODO: change global type to Object pointer
        if (sp1C->prevObj) {
            func_8029D704(sp20, sp68, D_8032CF9C->unk34);
            func_8029D558(sp20, sp1C->prevObj);
            func_8029EA0C(sp1C->prevObj);
        }
    }
    return 0;
}

struct struct8029D924 {
    /*0x00*/ s16 unk00;
    /*0x02*/ s16 unk02;
    /*0x04*/ s8 filler04[0x18-0x04];
    /*0x18*/ s32 unk18;
};

struct struct8029D924_2 {
    /*0x00*/ s32 unk00;
    /*0x04*/ s32 unk04;
};

struct struct802A1230 {
    /*0x00*/ s16 unk00;
    /*0x02*/ s16 unk02;
};

struct struct8029D924_2 *Geo18_8029D924(s32 sp40, struct struct8029D924 *sp44, UNUSED s32 sp48) {
    struct struct8029D924_2 *sp3C, *sp38;
    struct Object *sp34;
    struct struct8029D924 *sp30;
    UNUSED struct struct8029D924 *sp2C;
    s32 sp28;
    UNUSED struct struct8029D924_2 *sp24, *sp20, *sp1C, *sp18; // sp24 is unused in non-JP versions.

    sp3C = NULL;

    if (sp40 == 1) {
        sp34 = (struct Object *) D_8032CFA0; // TODO: change this to object pointer?
        sp30 = sp44;
        sp2C = sp44;

        if (D_8032CFA4) 
            sp34 = (struct Object *) D_8032CFA4->unk1C; // TODO: change this to object pointer?
            
        sp28 = sp34->oOpacity;
        sp3C = alloc_display_list(24); // likely sizeof(struct struct8029D924_2) * 3

        sp38 = sp3C;

        if (sp28 == 0xFF) {
            if (sp30->unk18 == 20)
                sp30->unk02 = 0x600 | (sp30->unk02 & 0xFF);
            else
